tap "homebrew/bundle"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# GNU database manager
brew "gdbm"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# File format designed to store large amounts of data
brew "hdf5"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool Command Language
brew "tcl-tk"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "lextudio.restructuredtext"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ritwickdey.liveserver"
vscode "spmeesseman.vscode-taskexplorer"
vscode "swyddfa.esbonio"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "yzhang.markdown-all-in-one"
