tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "Kindle", id: 302584613
vscode "github.copilot"
vscode "github.copilot-chat"
